Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/rx_tmr.c
/**
 * @file rx_tmr.c
 * @brief TMR HAL Driver Implementation (8-bit + 16-bit cascade)
 *
 * @details
 * Implementation of the TMR hardware abstraction layer for the RX72N
 * 8-bit Timer peripheral. Provides per-channel init/start/stop, counter
 * readout, microsecond period programming, and SELECTB ISR-callback
 * registration.
 *
 * ## Initialisation Sequence
 *
 * @verbatim
 *   rx_tmr_init(&config)
 *     |
 *     +-- 1. Validate config pointer (NASA Rule 5)
 *     +-- 2. Validate channel / clock / clear / outputs
 *     +-- 3. In cascade mode, require even channel
 *     +-- 4. Check not already initialised
 *     +-- 5. Enable unit module clock (MSTPA5 or MSTPA4, PRCR-gated)
 *     +-- 6. Stop counter (TCCR = 0)
 *     +-- 7. Program TCR  (interrupt enables + CCLR)
 *     +-- 8. Program TCSR (output select A/B)
 *     +-- 9. Preload TCCR clock bits into internal state (start writes them)
 *     +-- 10. Clear TCNT to 0
 *     +-- 11. Mark channel initialised
 *     +-- 12. In cascade mode, also configure paired odd channel
 * @endverbatim
 *
 * ## Channel Register Access
 *
 * Because even and odd TMR channels share a 16-byte block at different
 * parity byte offsets, the driver uses rx72n_tmr_regs.h inline accessors
 * (tmr0()..tmr3()) that each return a volatile pointer landing on the
 * correct byte. Each struct field then accesses only the target channel's
 * own byte.
 *
 * @par NASA Power of 10 Compliance
 * - Rule 1: No goto / recursion / setjmp
 * - Rule 2: All loops bounded
 * - Rule 3: No dynamic memory
 * - Rule 4: Functions kept short (decomposed helpers)
 * - Rule 5: >= 2 validation checks per public function
 * - Rule 6: Variables at smallest scope
 * - Rule 7: All return values checked / explicitly cast (void)
 * - Rule 8: C23 typed enums for constants
 * - Rule 9: Function pointer permitted for ISR DIP
 * - Rule 10: -Wall -Wextra -Werror clean
 *
 * @see rx_tmr.h Public API
 * @see rx72n_tmr_regs.h Register structures and bit definitions
 *
 * @author Locked, Inc.
 * @date 2026-04-21
 * @copyright Copyright (c) 2026 Locked Inc.
 * SPDX-License-Identifier: MIT
 * @since Version 1.0.0
 */

#include "rx_tmr.h"

#include <stddef.h>
#include <stdint.h>

#ifdef UNIT_TEST
#include "mock_rx72n_regs.h"
#else
#include "rx72n_regs.h"
#endif
#include "rx_check.h"
#include "rx_log.h"
#include "rx_register_protection.h"

/* =============================================================================
 * Module-private Constants
 * =============================================================================
 */

/**
 * @var s_tag
 * @brief Logging tag for the TMR module
 * @details 4 bytes in .rodata.
 * @since Version 1.0.0
 */
static const char* const s_tag = "TMR";

/**
 * @enum tmr_pclk_hz_t
 * @brief Peripheral clock rate for internal-clock period calculations
 *
 * @details
 * TMR counts on PCLKB, which is configured by the system clock init to
 * 60 MHz for the RX72N STAR platform. Period calculations use this
 * constant rather than a runtime clock query to keep the helper pure.
 *
 * @since Version 1.0.0
 */
typedef enum : uint32_t {
  k_tmr_pclkb_hz = 60000000U, /**< 60 MHz PCLKB on RX72N STAR */
} tmr_pclk_hz_t;

/**
 * @enum tmr_period_limits_t
 * @brief Compile-time period / divisor limits
 * @since Version 1.0.0
 */
typedef enum : uint32_t {
  k_tmr_us_per_sec      = 1000000U, /**< Microseconds per second */
  k_tmr_max_tcora       = 0xFFU,    /**< 8-bit TCORA maximum value */
  k_tmr_max_tcora_16bit = 0xFFFFU,  /**< 16-bit cascade TCORA maximum value */
} tmr_period_limits_t;

/**
 * @enum tmr_channel_count_t
 * @brief Array sizing constant for per-channel state
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_tmr_channel_count_internal = 4, /**< TMR0..TMR3 */
} tmr_channel_count_t;

/**
 * @enum tmr_pclk_divisor_t
 * @brief Integer prescaler ratios for internal clock sources
 * @details
 * The RX72N TMR peripheral divides PCLKB by one of these ratios before
 * feeding the counter. Each value mirrors a `k_tmr_clock_pclk_div_*`
 * enum value and is used by internal_tmr_clock_divider() to compute the
 * effective tick rate. Named constants avoid magic-number literals.
 * @since Version 1.0.0
 */
typedef enum : uint32_t {
  k_tmr_pclk_div_1    = 1U,    /**< Prescaler /1 */
  k_tmr_pclk_div_2    = 2U,    /**< Prescaler /2 */
  k_tmr_pclk_div_8    = 8U,    /**< Prescaler /8 */
  k_tmr_pclk_div_32   = 32U,   /**< Prescaler /32 */
  k_tmr_pclk_div_64   = 64U,   /**< Prescaler /64 */
  k_tmr_pclk_div_1024 = 1024U, /**< Prescaler /1024 */
  k_tmr_pclk_div_8192 = 8192U, /**< Prescaler /8192 */
  k_tmr_pclk_div_none = 0U,    /**< Sentinel: external clock (no PCLK divider) */
} tmr_pclk_divisor_t;

/**
 * @enum tmr_byte_shift_t
 * @brief Shift / mask constants for packing cascaded 16-bit counts
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_tmr_byte_shift = 8U,    /**< Shift to move high byte to bits [15:8] */
  k_tmr_byte_mask  = 0xFFU, /**< Mask for isolating one byte */
} tmr_byte_shift_t;

/* =============================================================================
 * Module-private State
 * =============================================================================
 */

/**
 * @var s_tmr_initialized
 * @brief Per-channel init flags indexed by rx_tmr_channel_t
 * @warning Do not modify directly - use rx_tmr_init() / rx_tmr_deinit()
 * @since Version 1.0.0
 */
static bool s_tmr_initialized[k_tmr_channel_count_internal] = {false, false, false, false};

/**
 * @var s_tmr_mode
 * @brief Per-channel operating mode (independent vs cascade)
 * @since Version 1.0.0
 */
static rx_tmr_mode_t s_tmr_mode[k_tmr_channel_count_internal] = {
  k_tmr_mode_8bit_independent,
  k_tmr_mode_8bit_independent,
  k_tmr_mode_8bit_independent,
  k_tmr_mode_8bit_independent,
};

/**
 * @var s_tmr_clock_bits
 * @brief Cached TCCR clock bits (CSS|CKS) applied at rx_tmr_start()
 *
 * @details
 * rx_tmr_init() computes the TCCR clock-field value but does NOT write it
 * immediately because that would start the counter. rx_tmr_start() OR's
 * these bits into TCCR when requested. rx_tmr_stop() clears the clock
 * field so the counter halts.
 *
 * @since Version 1.0.0
 */
static uint8_t s_tmr_clock_bits[k_tmr_channel_count_internal] = {0U, 0U, 0U, 0U};

/**
 * @var s_tmr_clock_source
 * @brief Cached clock-source enum per channel (needed by set_period_us)
 * @since Version 1.0.0
 */
static rx_tmr_clock_source_t s_tmr_clock_source[k_tmr_channel_count_internal] = {
  k_tmr_clock_pclk_div_1,
  k_tmr_clock_pclk_div_1,
  k_tmr_clock_pclk_div_1,
  k_tmr_clock_pclk_div_1,
};

/**
 * @var s_tmr_callback
 * @brief Per-channel compare-match / overflow callback pointers
 * @since Version 1.0.0
 */
static rx_tmr_isr_callback_t s_tmr_callback[k_tmr_channel_count_internal] = {
  NULL,
  NULL,
  NULL,
  NULL,
};

