Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/rx_tmr.c
/* =============================================================================
 * Internal Helpers
 * =============================================================================
 */

/**
 * @brief Get register pointer for a TMR channel
 * @param[in] channel Validated channel identifier (0..3)
 * @return Volatile pointer to the channel's register struct; NULL if invalid.
 * @since Version 1.0.0
 */
RX_STATIC_TESTABLE volatile rx_tmr_channel_regs_t* internal_tmr_get_regs(rx_tmr_channel_t channel)
{
  /* GCOVR_EXCL_BR_START(validate_config restricts channel to 0..3) */
  switch (channel) {
    case k_tmr_channel_0:
      return tmr0();
    case k_tmr_channel_1:
      return tmr1();
    case k_tmr_channel_2:
      return tmr2();
    case k_tmr_channel_3:
      return tmr3();
    default:                                        /* GCOVR_EXCL_LINE */
      RX_ASSERT(false, "TMR channel out of range"); /* GCOVR_EXCL_LINE */
      return NULL;                                  /* GCOVR_EXCL_LINE */
  }
  /* GCOVR_EXCL_BR_STOP */
}

/**
 * @brief Return the MSTPCRA bit mask for a TMR channel's unit
 * @param[in] channel Validated channel identifier
 * @return MSTPA5 for unit 0 (TMR0/1), MSTPA4 for unit 1 (TMR2/3), else 0.
 * @since Version 1.0.0
 */
static uint32_t internal_tmr_unit_mstp_bit(rx_tmr_channel_t channel)
{
  /* Public callers pre-validate channel in 0..3 via internal_tmr_validate_config, so
   * anything not in unit 0 (TMR0/1) must belong to unit 1 (TMR2/3). */
  if ((channel == k_tmr_channel_0) || (channel == k_tmr_channel_1)) {
    return k_tmr_mstpcra_mstpa5;
  }
  return k_tmr_mstpcra_mstpa4;
}

/**
 * @brief Enable the module clock for the channel's TMR unit
 * @param[in] channel Validated channel identifier
 * @pre PRCR register accessible
 * @post MSTPCRA bit cleared for the unit
 * @since Version 1.0.0
 */
static void internal_tmr_enable_module_clock(rx_tmr_channel_t channel)
{
  const uint32_t mstp_bit = internal_tmr_unit_mstp_bit(channel);

  *prcr_reg() = k_rx_prcr_unlock_prc1;
  system_regs()->mstpcra &= ~mstp_bit;
  *prcr_reg() = k_rx_prcr_lock;
}

/**
 * @brief Map a clock source to TCCR CSS|CKS bits
 * @param[in]  source Validated clock-source enumeration value
 * @param[out] bits   Receives the composed TCCR[4:0] bits
 * @return k_rx_ok on success, k_rx_err_invalid_arg on unknown value.
 * @since Version 1.0.0
 */
static rx_err_t internal_tmr_clock_bits(rx_tmr_clock_source_t source, uint8_t* bits)
{
  /* GCOVR_EXCL_BR_START(validate_config blocks out-of-range clock_source) */
  switch (source) {
    case k_tmr_clock_pclk_div_1:
      *bits = (uint8_t)(k_tmr_tccr_css_internal | k_tmr_tccr_cks_pclk_div1);
      return k_rx_ok;
    case k_tmr_clock_pclk_div_2:
      *bits = (uint8_t)(k_tmr_tccr_css_internal | k_tmr_tccr_cks_pclk_div2);
      return k_rx_ok;
    case k_tmr_clock_pclk_div_8:
      *bits = (uint8_t)(k_tmr_tccr_css_internal | k_tmr_tccr_cks_pclk_div8);
      return k_rx_ok;
    case k_tmr_clock_pclk_div_32:
      *bits = (uint8_t)(k_tmr_tccr_css_internal | k_tmr_tccr_cks_pclk_div32);
      return k_rx_ok;
    case k_tmr_clock_pclk_div_64:
      *bits = (uint8_t)(k_tmr_tccr_css_internal | k_tmr_tccr_cks_pclk_div64);
      return k_rx_ok;
    case k_tmr_clock_pclk_div_1024:
      *bits = (uint8_t)(k_tmr_tccr_css_internal | k_tmr_tccr_cks_pclk_div1024);
      return k_rx_ok;
    case k_tmr_clock_pclk_div_8192:
      *bits = (uint8_t)(k_tmr_tccr_css_internal | k_tmr_tccr_cks_pclk_div8192);
      return k_rx_ok;
    case k_tmr_clock_external_rising:
      *bits = (uint8_t)(k_tmr_tccr_css_external | k_tmr_tccr_cks_ext_rising);
      return k_rx_ok;
    case k_tmr_clock_external_falling:
      *bits = (uint8_t)(k_tmr_tccr_css_external | k_tmr_tccr_cks_ext_falling);
      return k_rx_ok;
    case k_tmr_clock_external_both:
      *bits = (uint8_t)(k_tmr_tccr_css_external | k_tmr_tccr_cks_ext_both);
      return k_rx_ok;
    default: /* GCOVR_EXCL_LINE -- validate_config blocks out-of-range clock_source */
      return k_rx_err_invalid_arg; /* GCOVR_EXCL_LINE */
  }
  /* GCOVR_EXCL_BR_STOP */
}

/**
 * @brief Return the integer divider for an internal clock source
 * @param[in] source Internal clock-source enumeration value
 * @return PCLK divider (1, 2, 8, 32, 64, 1024, 8192) or 0 for external.
 * @since Version 1.0.0
 */
static uint32_t internal_tmr_clock_divider(rx_tmr_clock_source_t source)
{
  switch (source) {
    case k_tmr_clock_pclk_div_1:
      return k_tmr_pclk_div_1;
    case k_tmr_clock_pclk_div_2:
      return k_tmr_pclk_div_2;
    case k_tmr_clock_pclk_div_8:
      return k_tmr_pclk_div_8;
    case k_tmr_clock_pclk_div_32:
      return k_tmr_pclk_div_32;
    case k_tmr_clock_pclk_div_64:
      return k_tmr_pclk_div_64;
    case k_tmr_clock_pclk_div_1024:
      return k_tmr_pclk_div_1024;
    case k_tmr_clock_pclk_div_8192:
      return k_tmr_pclk_div_8192;
    default:
      return k_tmr_pclk_div_none; /* External or invalid */
  }
}

/**
 * @brief Compose TCR value from config
 * @param[in] config Validated configuration
 * @return TCR value with CCLR field + interrupt enables set per config.
 * @since Version 1.0.0
 */
static uint8_t internal_tmr_compose_tcr(const rx_tmr_config_t* config)
{
  uint8_t tcr = 0U;

  if ((config->irq_mask & k_tmr_irq_cmp_match_a) != 0U) {
    tcr |= k_tmr_tcr_cmiea;
  }
  if ((config->irq_mask & k_tmr_irq_cmp_match_b) != 0U) {
    tcr |= k_tmr_tcr_cmieb;
  }
  if ((config->irq_mask & k_tmr_irq_overflow) != 0U) {
    tcr |= k_tmr_tcr_ovie;
  }

  /* GCOVR_EXCL_BR_START(validate_config blocks out-of-range counter_clear) */
  switch (config->counter_clear) {
    case k_tmr_clear_disabled:
      tcr |= k_tmr_tcr_cclr_disabled;
      break;
    case k_tmr_clear_cmp_match_a:
      tcr |= k_tmr_tcr_cclr_cmp_match_a;
      break;
    case k_tmr_clear_cmp_match_b:
      tcr |= k_tmr_tcr_cclr_cmp_match_b;
      break;
    case k_tmr_clear_external_reset:
      tcr |= k_tmr_tcr_cclr_external_sig;
      break;
    default: /* GCOVR_EXCL_LINE -- validate_config blocks out-of-range counter_clear */
      break; /* GCOVR_EXCL_LINE */
  }
  /* GCOVR_EXCL_BR_STOP */
  return tcr;
}

/**
 * @brief Compose TCSR value from config (OSA/OSB fields)
 * @param[in] config Validated configuration
 * @return TCSR value with OSA/OSB populated; ADTE left at 0.
 * @since Version 1.0.0
 */
static uint8_t internal_tmr_compose_tcsr(const rx_tmr_config_t* config)
{
  const uint8_t osa = (uint8_t)(((uint8_t)config->output_a) << k_tmr_tcsr_osa_shift);
  const uint8_t osb = (uint8_t)(((uint8_t)config->output_b) << k_tmr_tcsr_osb_shift);
  return (uint8_t)(osa | osb);
}

/**
 * @brief Validate enum fields of a configuration
 * @param[in] config Non-null configuration
 * @return k_rx_ok if all enum fields are in range.
 * @since Version 1.0.0
 */
static rx_err_t internal_tmr_validate_config(const rx_tmr_config_t* config)
{
  if ((uint8_t)config->channel >= k_tmr_channel_count_internal) {
    return k_rx_err_invalid_arg;
  }
  if ((config->mode != k_tmr_mode_8bit_independent) && (config->mode != k_tmr_mode_16bit_cascade)) {
    return k_rx_err_invalid_arg;
  }
  if ((uint8_t)config->counter_clear > k_tmr_clear_external_reset) {
    return k_rx_err_invalid_arg;
  }
  if ((uint8_t)config->output_a > k_tmr_output_toggle) {
    return k_rx_err_invalid_arg;
  }
  if ((uint8_t)config->output_b > k_tmr_output_toggle) {
    return k_rx_err_invalid_arg;
  }
  if ((uint8_t)config->clock_source > k_tmr_clock_external_both) {
    return k_rx_err_invalid_arg;
  }
  /* Cascade mode requires an even channel */
  if (config->mode == k_tmr_mode_16bit_cascade) {
    if ((config->channel != k_tmr_channel_0) && (config->channel != k_tmr_channel_2)) {
      return k_rx_err_invalid_arg;
    }
  }
  return k_rx_ok;
}

/**
 * @brief Write register fields for a single channel during init
 * @param[in] channel Channel to program (even or odd)
 * @param[in] config  Source configuration
 * @since Version 1.0.0
 */
static void internal_tmr_program_channel(rx_tmr_channel_t channel, const rx_tmr_config_t* config)
{
  volatile rx_tmr_channel_regs_t* regs = internal_tmr_get_regs(channel);

  regs->tccr  = 0U; /* Stop counter before programming */
  regs->tcr   = internal_tmr_compose_tcr(config);
  regs->tcsr  = internal_tmr_compose_tcsr(config);
  regs->tcora = k_tmr_max_tcora;
  regs->tcorb = k_tmr_max_tcora;
  regs->tcnt  = 0U;
}

