Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/rx_tmr.c
/* =============================================================================
 * Public API
 * =============================================================================
 */

/**
 * @brief Program the paired odd channel in a 16-bit cascade configuration
 * @details
 * Extracted from rx_tmr_init() to keep the caller under the function-size
 * threshold. The even channel counts on its selected clock source; the
 * odd channel counts on the even channel's TCORA compare match via
 * CSS = cascade.
 * @param[in] config Validated primary (even) channel config
 * @since Version 1.0.0
 */
static void internal_tmr_init_cascade_pair(const rx_tmr_config_t* config)
{
  const rx_tmr_channel_t odd =
    (config->channel == k_tmr_channel_0) ? k_tmr_channel_1 : k_tmr_channel_3;

  rx_tmr_config_t odd_cfg = *config;
  odd_cfg.channel         = odd;
  internal_tmr_program_channel(odd, &odd_cfg);

  volatile rx_tmr_channel_regs_t* odd_regs = internal_tmr_get_regs(odd);
  odd_regs->tccr                           = k_tmr_tccr_css_cascade;

  s_tmr_mode[(uint8_t)odd]         = k_tmr_mode_16bit_cascade;
  s_tmr_initialized[(uint8_t)odd]  = true;
  s_tmr_clock_bits[(uint8_t)odd]   = k_tmr_tccr_css_cascade;
  s_tmr_clock_source[(uint8_t)odd] = config->clock_source;
}

rx_err_t rx_tmr_init(const rx_tmr_config_t* config)
{
  /* Pre-condition 1: non-null config */
  RX_CHECK_NULL_PTR(config, s_tag, "Config pointer is NULL");

  /* Pre-condition 2: enum ranges */
  rx_err_t err = internal_tmr_validate_config(config);
  if (err != k_rx_ok) {
    rx_log_error(s_tag, "Invalid TMR config");
    return err;
  }

  const uint8_t idx = (uint8_t)config->channel;

  /* Pre-condition 3: not already initialised */
  if (s_tmr_initialized[idx]) {
    rx_log_error(s_tag, "Channel already initialised");
    return k_rx_err_invalid_state;
  }

  /* Compose clock bits (validated via enum range above) */
  uint8_t clock_bits = 0U;
  err                = internal_tmr_clock_bits(config->clock_source, &clock_bits);
  if (err != k_rx_ok) { /* GCOVR_EXCL_LINE -- validate_config blocks out-of-range clock_source */
    return err;         /* GCOVR_EXCL_LINE */
  } /* GCOVR_EXCL_BR_LINE */

  /* 1. Enable unit module clock */
  internal_tmr_enable_module_clock(config->channel);

  /* 2. Program the primary channel */
  internal_tmr_program_channel(config->channel, config);

  /* 3. For cascade mode, program the paired odd channel */
  if (config->mode == k_tmr_mode_16bit_cascade) {
    internal_tmr_init_cascade_pair(config);
  }

  /* 4. Cache state for the primary channel */
  s_tmr_mode[idx]         = config->mode;
  s_tmr_clock_bits[idx]   = clock_bits;
  s_tmr_clock_source[idx] = config->clock_source;
  s_tmr_initialized[idx]  = true;

  rx_log_info_val(s_tag, "TMR channel initialised", (uint32_t)config->channel);
  return k_rx_ok;
}

rx_err_t rx_tmr_start(rx_tmr_channel_t channel)
{
  if ((uint8_t)channel >= k_tmr_channel_count_internal) {
    return k_rx_err_invalid_arg;
  }
  const uint8_t idx = (uint8_t)channel;
  RX_VALIDATE_INIT(s_tmr_initialized[idx], s_tag, "Channel not initialised");

  volatile rx_tmr_channel_regs_t* regs = internal_tmr_get_regs(channel);
  regs->tccr                           = s_tmr_clock_bits[idx];

  /* In cascade mode the paired odd channel also needs its cascade bits
   * kept after a stop/start cycle. Cascade is only valid on even channels
   * (enforced by validate_config), so the ternary below is exhaustive. */
  if (s_tmr_mode[idx] == k_tmr_mode_16bit_cascade) {
    volatile rx_tmr_channel_regs_t* odd_regs = (channel == k_tmr_channel_0) ? tmr1() : tmr3();
    odd_regs->tccr                           = k_tmr_tccr_css_cascade;
  }
  return k_rx_ok;
}

rx_err_t rx_tmr_stop(rx_tmr_channel_t channel)
{
  if ((uint8_t)channel >= k_tmr_channel_count_internal) {
    return k_rx_err_invalid_arg;
  }
  const uint8_t idx = (uint8_t)channel;
  RX_VALIDATE_INIT(s_tmr_initialized[idx], s_tag, "Channel not initialised");

  volatile rx_tmr_channel_regs_t* regs = internal_tmr_get_regs(channel);
  regs->tccr                           = 0U;

  if (s_tmr_mode[idx] == k_tmr_mode_16bit_cascade) {
    volatile rx_tmr_channel_regs_t* odd_regs = (channel == k_tmr_channel_0) ? tmr1() : tmr3();
    odd_regs->tccr                           = 0U;
  }
  return k_rx_ok;
}

rx_err_t rx_tmr_read(rx_tmr_channel_t channel, uint16_t* value)
{
  RX_CHECK_NULL_PTR(value, s_tag, "Value pointer is NULL");
  if ((uint8_t)channel >= k_tmr_channel_count_internal) {
    return k_rx_err_invalid_arg;
  }
  const uint8_t idx = (uint8_t)channel;
  RX_VALIDATE_INIT(s_tmr_initialized[idx], s_tag, "Channel not initialised");

  if (s_tmr_mode[idx] == k_tmr_mode_16bit_cascade) {
    const uint8_t          upper = internal_tmr_get_regs(channel)->tcnt;
    const rx_tmr_channel_t odd   = (channel == k_tmr_channel_0) ? k_tmr_channel_1 : k_tmr_channel_3;
    const uint8_t          lower = internal_tmr_get_regs(odd)->tcnt;
    *value = (uint16_t)(((uint16_t)upper << (uint16_t)k_tmr_byte_shift) | (uint16_t)lower);
  } else {
    *value = (uint16_t)internal_tmr_get_regs(channel)->tcnt;
  }
  return k_rx_ok;
}

rx_err_t rx_tmr_set_period_us(rx_tmr_channel_t channel, uint32_t period_us)
{
  if ((uint8_t)channel >= k_tmr_channel_count_internal) {
    return k_rx_err_invalid_arg;
  }
  const uint8_t idx = (uint8_t)channel;
  RX_VALIDATE_INIT(s_tmr_initialized[idx], s_tag, "Channel not initialised");

  if (period_us == 0U) {
    return k_rx_err_invalid_arg;
  }

  const uint32_t divider = internal_tmr_clock_divider(s_tmr_clock_source[idx]);
  if (divider == 0U) {
    /* External clock selected - cannot compute period */
    return k_rx_err_invalid_arg;
  }

  /* tick_hz = PCLKB / divider; ticks = period_us * tick_hz / 1e6
   * compare = ticks - 1 (TCORA fires when TCNT reaches compare value) */
  const uint64_t ticks = ((uint64_t)period_us * (uint64_t)k_tmr_pclkb_hz) /
                         ((uint64_t)divider * (uint64_t)k_tmr_us_per_sec);
  if (ticks == 0U) {
    return k_rx_err_invalid_arg;
  }
  const uint64_t compare = ticks - 1U;

  const uint32_t max_compare =
    (s_tmr_mode[idx] == k_tmr_mode_16bit_cascade) ? k_tmr_max_tcora_16bit : k_tmr_max_tcora;
  if (compare > (uint64_t)max_compare) {
    rx_log_error_val(s_tag, "Period too large for divider", period_us);
    return k_rx_err_invalid_arg;
  }

