Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/rx_tmr.c
  if (s_tmr_mode[idx] == k_tmr_mode_16bit_cascade) {
    const rx_tmr_channel_t odd = (channel == k_tmr_channel_0) ? k_tmr_channel_1 : k_tmr_channel_3;
    internal_tmr_get_regs(channel)->tcora =
      (uint8_t)((compare >> (uint64_t)k_tmr_byte_shift) & (uint64_t)k_tmr_byte_mask);
    internal_tmr_get_regs(odd)->tcora = (uint8_t)(compare & (uint64_t)k_tmr_byte_mask);
  } else {
    internal_tmr_get_regs(channel)->tcora = (uint8_t)(compare & (uint64_t)k_tmr_byte_mask);
  }
  return k_rx_ok;
}

rx_err_t rx_tmr_register_compare_match_isr(rx_tmr_channel_t channel, rx_tmr_isr_callback_t callback)
{
  if ((uint8_t)channel >= k_tmr_channel_count_internal) {
    return k_rx_err_invalid_arg;
  }
  s_tmr_callback[(uint8_t)channel] = callback;
  return k_rx_ok;
}

rx_err_t rx_tmr_deinit(rx_tmr_channel_t channel)
{
  if ((uint8_t)channel >= k_tmr_channel_count_internal) {
    return k_rx_err_invalid_arg;
  }

  volatile rx_tmr_channel_regs_t* regs = internal_tmr_get_regs(channel);
  regs->tccr                           = 0U;
  regs->tcr                            = 0U;
  regs->tcsr                           = 0U;
  regs->tcora                          = 0U;
  regs->tcorb                          = 0U;
  regs->tcnt                           = 0U;

  const uint8_t idx = (uint8_t)channel;
  if (s_tmr_mode[idx] == k_tmr_mode_16bit_cascade) {
    const rx_tmr_channel_t odd = (channel == k_tmr_channel_0) ? k_tmr_channel_1 : k_tmr_channel_3;
    volatile rx_tmr_channel_regs_t* odd_regs = internal_tmr_get_regs(odd);
    odd_regs->tccr                           = 0U;
    odd_regs->tcr                            = 0U;
    odd_regs->tcsr                           = 0U;
    odd_regs->tcora                          = 0U;
    odd_regs->tcorb                          = 0U;
    odd_regs->tcnt                           = 0U;
    s_tmr_initialized[(uint8_t)odd]          = false;
    s_tmr_mode[(uint8_t)odd]                 = k_tmr_mode_8bit_independent;
    s_tmr_clock_bits[(uint8_t)odd]           = 0U;
    s_tmr_callback[(uint8_t)odd]             = NULL;
  }

  s_tmr_initialized[idx] = false;
  s_tmr_mode[idx]        = k_tmr_mode_8bit_independent;
  s_tmr_clock_bits[idx]  = 0U;
  s_tmr_callback[idx]    = NULL;
  return k_rx_ok;
}

/* =============================================================================
 * ISR Dispatch Hooks (SELECTB)
 * =============================================================================
 */

/**
 * @brief Internal dispatcher invoked by the SELECTB vector shim
 *
 * @details
 * Called from the low-level vector when a TMR CMIA/CMIB/OVI interrupt
 * fires. Clears the source flag in the TMR (compare-match sets no
 * persistent status bit, so the hardware does it automatically; this
 * function exists so the test harness can synthesise ISR invocations)
 * and invokes the registered user callback.
 *
 * @param[in] channel TMR channel whose interrupt fired (0..3)
 * @since Version 1.0.0
 */
void rx_tmr_isr_dispatch(rx_tmr_channel_t channel)
{
  if ((uint8_t)channel >= k_tmr_channel_count_internal) {
    return;
  }
  rx_tmr_isr_callback_t cb = s_tmr_callback[(uint8_t)channel];
  if (cb != NULL) {
    cb(channel);
  }
}
